//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Εκτέλεση βήματος %d από %d: Δημιουργία αποθήκευσης οντότητας";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Εκτέλεση βήματος %dαπό %d: Δημιουργία βάσης δεδομένων bootstrap";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Εκτέλεση βήματος %d από %d: Δημιουργία βάσης δεδομένων ουράς αίτησης";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Εκτέλεση βήματος %d από %d: Λήψη αποθήκευσης οντότητας. Παραλήφθηκαν %s από %s’ μέχρι τώρα.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Εκτέλεση βήματος %d από %d: Διαγραφή ληγμένων αιτήσεων";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Εκτέλεση βήματος %d από %d: Φόρτωση των μεταδεδομένων";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Εκτέλεση βήματος %d από %d: Εκτέλεση συγχώνευσης ουράς αίτησης";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Εκτέλεση βήματος %d από %d: Εκτέλεση συγχώνευσης κίνησης";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Εκτέλεση βήματος %d από %d: Εκτέλεση συγχώνευσης δημιουργίας/διαγραφής";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Εκτέλεση βήματος %d από %d: Επεξεργασία για καθορισμό ερωτημάτων %s χρησιμοποιώντας %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Εκτέλεση βήματος %d από %d: Επεξεργασία αιτήσεων. Αποστολή αίτησης τροποποίησης %s από %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Εκτέλεση βήματος %d από %d: Εφαρμογή αλλαγών εκ νέου";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Εκτέλεση βήματος %d από %d: Ανάλυση παραληφθέντων δεδομένων";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Εκτέλεση βήματος %d από %d: Παραλαβή δεδομένων από τον διακομιστή. Παραλήφθηκαν %s μέχρι τώρα.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Εκτέλεση βήματος %d από %d: Κατάργηση διαγραμμένων σχέσεων";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Εκτέλεση βήματος %d από %d: Κατάργηση αιτήσεων που καθορίζονται ως RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Εκτέλεση βήματος %d από %d: Αποστολή δεδομένων στον διακομιστή. Στάλθηκαν %s μέχρι τώρα.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Εκτέλεση βήματος %d από %d: Αποστολή αποθήκευσης οντότητας. Στάλθηκαν %s από %s’ μέχρι τώρα.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Εκτέλεση βήματος %d από %d: Αποστολή βάσης δεδομένων ουράς αίτησης. Στάλθηκαν %s από %s’ μέχρι τώρα.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Εκτέλεση βήματος %d από %d: Έναρξη επικοινωνίας με τον διακομιστή";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Εκτέλεση βήματος %d από %d: Προεπεξεργασία αιτήσεων πριν την φόρτωση";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Εκτέλεση βήματος %d από %d: Αναμονή για λήψη";

